src/Reports/ОтчетПоЦенамМатериаловСУчётомЗамен/ОтчетПоЦенамМатериаловСУчётомЗамен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоЦенамМатериаловСУчётомЗамен</name>
</mdclass:Report>

src/Documents/СпецификацияКДоговоруСПоставщиком/СпецификацияКДоговоруСПоставщиком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияКДоговоруСПоставщиком</name>
  <basedOn>Catalog.Договоры</basedOn>
  <registerRecords>AccumulationRegister.ДоговорыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.ЦеныПлановые</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступлениеМПЗ/ПоступлениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМПЗ</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокВходящий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>Текущий курс</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>НЦ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоВалюта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГТД</name>
      <comment>Номер грузовой таможенной декларации</comment>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчетПоЦенамМатериаловСУчётомЗамен/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьСписокАналогов(МПЗ)
СписокАналогов = Новый СписокЗначений;

ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиМПЗ(МПЗ);
	Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
		Если ТипЗнч(ТЧ_ТА.Ссылка.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
       		Если СписокАналогов.НайтиПоЗначению(ТЧ_ТА.Ссылка.Элемент) = Неопределено Тогда
			СписокАналогов.Добавить(ТЧ_ТА.Ссылка.Элемент);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		Для каждого Замена Из МПЗ.Замены Цикл
			Если ТипЗнч(Замена.Материал) <> Тип("Неопределено") Тогда
			СписокАналогов.Добавить(Замена.Материал,,Истина);
			КонецЕсли;
		КонецЦикла;
Возврат(СписокАналогов);
КонецФункции   
 
&НаСервере
Функция ПолучитьПоследнююСпецификациюДоговора(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Дата КАК Дата,
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Цена КАК Цена,
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Договор.Валюта КАК Валюта,
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Договор.БезНДС КАК ДоговорБезНДС,
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.ДействуетДо КАК ДействуетДо
	|ИЗ
	|	Документ.СпецификацияКДоговоруСПоставщиком.ТабличнаяЧасть КАК СпецификацияКДоговоруСПоставщикомТабличнаяЧасть
	|ГДЕ
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.ДействуетДо >= &ДействуетДо
	|	И СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.МПЗ = &МПЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Дата УБЫВ";
Запрос.УстановитьПараметр("ДействуетДо", НачалоДня(ТекущаяДата()));
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Новый Структура("ДатаНачала,ДатаОкончания,Цена,БезНДС,Валюта",ВыборкаДетальныеЗаписи.Дата,ВыборкаДетальныеЗаписи.ДействуетДо,ВыборкаДетальныеЗаписи.Цена,ВыборкаДетальныеЗаписи.ДоговорБезНДС,ВыборкаДетальныеЗаписи.Валюта));
	КонецЦикла;
Возврат(Неопределено);
КонецФункции
    
&НаСервере
Функция ПолучитьЦенуПоследнейЗакупки(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеМПЗТабличнаяЧасть.Цена КАК Цена,
	|	ПоступлениеМПЗТабличнаяЧасть.ЦенаВалюта КАК ЦенаВалюта,
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Договор.Валюта КАК Валюта,
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование КАК ДокументОснование,
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Договор.БезНДС КАК БезНДС
	|ИЗ
	|	Документ.ПоступлениеМПЗ.ТабличнаяЧасть КАК ПоступлениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ПоступлениеМПЗТабличнаяЧасть.МПЗ = &МПЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеМПЗТабличнаяЧасть.Ссылка.Дата УБЫВ";
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументОснование) Тогда
		Дата = ВыборкаДетальныеЗаписи.ДокументОснование.Дата;	
		Иначе	
		Дата = "";
		КонецЕсли;
			Если ВыборкаДетальныеЗаписи.Валюта = Константы.ОсновнаяВалюта.Получить() Тогда
			Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата",ВыборкаДетальныеЗаписи.Цена,ВыборкаДетальныеЗаписи.Валюта,ВыборкаДетальныеЗаписи.БезНДС,Дата));
			Иначе	
			Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата",ВыборкаДетальныеЗаписи.ЦенаВалюта,ВыборкаДетальныеЗаписи.Валюта,ВыборкаДетальныеЗаписи.БезНДС,Дата));
			КонецЕсли; 
	КонецЦикла;
Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата","","","",""));
КонецФункции

&НаСервере
Функция ПолучитьЦенуЗаказаВПути(МПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, МПЗ = &МПЗ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата УБЫВ";
Запрос.УстановитьПараметр("МПЗ", МПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Выборка = ВыборкаДетальныеЗаписи.ЗаказПоставщику.ТабличнаяЧасть.НайтиСтроки(Новый Структура("МПЗ",МПЗ));
		Если ВыборкаДетальныеЗаписи.ЗаказПоставщику.Договор.Валюта = Константы.ОсновнаяВалюта.Получить() Тогда
		Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата",Выборка[0].Цена,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Договор.Валюта,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Договор.БезНДС,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Дата));
		Иначе	
		Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата",Выборка[0].ЦенаВалюта,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Договор.Валюта,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Договор.БезНДС,ВыборкаДетальныеЗаписи.ЗаказПоставщику.Дата));
		КонецЕсли;
	КонецЦикла;
Возврат(Новый Структура("Цена,Валюта,БезНДС,Дата","","","",""));
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();       
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблГруппа = Макет.ПолучитьОбласть("Группа");
ОблМПЗ = Макет.ПолучитьОбласть("МПЗ");
ОблЗамена = Макет.ПолучитьОбласть("Замена");
ОблАналог = Макет.ПолучитьОбласть("Аналог");
ОблКонец = Макет.ПолучитьОбласть("Конец");
  
ОблШапка.Параметры.КурсUSD = ОбщийМодульВызовСервера.КурсДляВалюты(Справочники.Валюты.НайтиПоКоду(840),ТекущаяДата()); 
ОблШапка.Параметры.КурсEUR = ОбщийМодульВызовСервера.КурсДляВалюты(Справочники.Валюты.НайтиПоКоду(978),ТекущаяДата());
ОблШапка.Параметры.КурсCNY = ОбщийМодульВызовСервера.КурсДляВалюты(Справочники.Валюты.НайтиПоКоду(156),ТекущаяДата());
ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Родитель КАК Родитель,
	|	Материалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка В ИЕРАРХИИ(&СписокМПЗ)
	|	И Материалы.ЭтоГруппа = ЛОЖЬ
	|	И Материалы.ПометкаУдаления = ЛОЖЬ";
	Если ТипРиска = 0 Тогда
	Запрос.Текст = Запрос.Текст + " И Материалы.ТипРиска <> &ТипРиска";
	Запрос.УстановитьПараметр("ТипРиска", Перечисления.ТипыРиска.ПустаяСсылка()); 
	ИначеЕсли ТипРиска = 1 Тогда
	Запрос.Текст = Запрос.Текст + " И Материалы.ТипРиска В(&СписокТиповРиска)";
	Запрос.УстановитьПараметр("СписокТиповРиска", СписокТиповРиска); 
	ИначеЕсли ТипРиска = 2 Тогда
	Запрос.Текст = Запрос.Текст + " И НЕ Материалы.ТипРиска В(&СписокТиповРиска)";
	Запрос.УстановитьПараметр("СписокТиповРиска", СписокТиповРиска);
	КонецЕсли;
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	Материалы.Родитель.Наименование,
								|	Материалы.Наименование
								|ИТОГИ ПО
								|	Родитель";
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРодитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРодитель.Следующий() Цикл 
	ОблГруппа.Параметры.ГруппаМПЗ = СокрЛП(ВыборкаРодитель.Родитель.Наименование);
    ТабДок.Вывести(ОблГруппа);
	ТабДок.НачатьГруппуСтрок("МПЗ",Истина);	
	ВыборкаДетальныеЗаписи = ВыборкаРодитель.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОблМПЗ.Параметры.Наименование = СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.Наименование);
		ОблМПЗ.Параметры.МПЗ = ВыборкаДетальныеЗаписи.Ссылка;
		ОблМПЗ.Параметры.Статус = ПолучитьСтатус(ВыборкаДетальныеЗаписи.Ссылка);
		ОблМПЗ.Параметры.ГруппаПоЗакупкам = ВыборкаДетальныеЗаписи.Ссылка.ГруппаПоЗакупкам;
		ОблМПЗ.Параметры.ЕдиницаИзмерения = СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.ЕдиницаИзмерения.Наименование);
		Результат = ПолучитьПоследнююСпецификациюДоговора(ВыборкаДетальныеЗаписи.Ссылка);
			Если Результат <> Неопределено Тогда				
			ОблМПЗ.Параметры.ДатаНачала = Результат.ДатаНачала;
			ОблМПЗ.Параметры.ДатаОкончания = Результат.ДатаОкончания;
			ОблМПЗ.Параметры.Цена = Результат.Цена;
			ОблМПЗ.Параметры.Валюта = Результат.Валюта;
			ОблМПЗ.Параметры.БезНДС1 = Результат.БезНДС;
			Иначе
			ОблМПЗ.Параметры.ДатаНачала = "";
			ОблМПЗ.Параметры.ДатаОкончания = "";
			ОблМПЗ.Параметры.Цена = "";
			ОблМПЗ.Параметры.Валюта = "";
			ОблМПЗ.Параметры.БезНДС1 = "";			
			КонецЕсли;
		Результат = ПолучитьЦенуПоследнейЗакупки(ВыборкаДетальныеЗаписи.Ссылка);
		ОблМПЗ.Параметры.ЦенаПоследнейЗакупки = Результат.Цена;
		ОблМПЗ.Параметры.ВалютаПоследнейЗакупки = Результат.Валюта;
		ОблМПЗ.Параметры.БезНДС2 = Результат.БезНДС;
		ОблМПЗ.Параметры.ДатаЗаказа = Результат.Дата;
		Результат = ПолучитьЦенуЗаказаВПути(ВыборкаДетальныеЗаписи.Ссылка);
		ОблМПЗ.Параметры.ЦенаЗаказаВПути = Результат.Цена;
		ОблМПЗ.Параметры.ВалютаЗаказаВПути = Результат.Валюта;
		ОблМПЗ.Параметры.БезНДС3 = Результат.БезНДС;
		ОблМПЗ.Параметры.ДатаЗаказаВПути = Результат.Дата;
    	ТабДок.Вывести(ОблМПЗ);
		ТабДок.НачатьГруппуСтрок("Аналоги",Истина);		
		СписокАналогов = ПолучитьСписокАналогов(ВыборкаДетальныеЗаписи.Ссылка);
			Для каждого Аналог Из СписокАналогов Цикл
			ВыбАналог = Аналог.Значение;
				Если Аналог.Пометка Тогда 
					Если ТипЗнч(Аналог.Значение) = Тип("Строка") Тогда
					ОблЗамена.Параметры.Наименование = ВыбАналог;
					ОблЗамена.Параметры.МПЗ = "";
					ОблЗамена.Параметры.Статус = "";
					ОблЗамена.Параметры.ГруппаПоЗакупкам = "";
					ОблЗамена.Параметры.ЕдиницаИзмерения = "";
					ОблЗамена.Параметры.ДатаНачала = "";
					ОблЗамена.Параметры.ДатаОкончания = "";
					ОблЗамена.Параметры.Цена = "";
					ОблЗамена.Параметры.Валюта = "";
					ОблЗамена.Параметры.ЦенаПоследнейЗакупки = "";
					ОблЗамена.Параметры.ВалютаПоследнейЗакупки = "";
					ОблЗамена.Параметры.ДатаЗаказа = "";
					ОблЗамена.Параметры.ЦенаЗаказаВПути = "";
					ОблЗамена.Параметры.ВалютаЗаказаВПути = "";
					ОблЗамена.Параметры.ДатаЗаказаВПути = "";
					ОблЗамена.Параметры.БезНДС1 = "";
					ОблЗамена.Параметры.БезНДС2 = "";
					ОблЗамена.Параметры.БезНДС3 = "";					
					Иначе	
					ОблЗамена.Параметры.Наименование = СокрЛП(ВыбАналог.Наименование);
					ОблЗамена.Параметры.МПЗ = ВыбАналог;
					ОблЗамена.Параметры.Статус = ПолучитьСтатус(ВыбАналог);
					ОблЗамена.Параметры.ГруппаПоЗакупкам = ВыбАналог.ГруппаПоЗакупкам;
					ОблЗамена.Параметры.ЕдиницаИзмерения = СокрЛП(ВыбАналог.ЕдиницаИзмерения.Наименование);
					Результат = ПолучитьПоследнююСпецификациюДоговора(ВыбАналог);
						Если Результат <> Неопределено Тогда				
						ОблЗамена.Параметры.ДатаНачала = Результат.ДатаНачала;
						ОблЗамена.Параметры.ДатаОкончания = Результат.ДатаОкончания;
						ОблЗамена.Параметры.Цена = Результат.Цена;
						ОблЗамена.Параметры.Валюта = Результат.Валюта;
						ОблЗамена.Параметры.БезНДС1 = Результат.БезНДС;
						Иначе
						ОблЗамена.Параметры.ДатаНачала = "";
						ОблЗамена.Параметры.ДатаОкончания = "";
						ОблЗамена.Параметры.Цена = "";
						ОблЗамена.Параметры.Валюта = "";
						ОблЗамена.Параметры.БезНДС1 = "";
						КонецЕсли;
					Результат = ПолучитьЦенуПоследнейЗакупки(ВыбАналог);
					ОблЗамена.Параметры.ЦенаПоследнейЗакупки = Результат.Цена;
					ОблЗамена.Параметры.ВалютаПоследнейЗакупки = Результат.Валюта;
					ОблЗамена.Параметры.БезНДС2 = Результат.БезНДС;
					ОблЗамена.Параметры.ДатаЗаказа = Результат.Дата;
					Результат = ПолучитьЦенуЗаказаВПути(ВыбАналог);
					ОблЗамена.Параметры.ЦенаЗаказаВПути = Результат.Цена;
					ОблЗамена.Параметры.ВалютаЗаказаВПути = Результат.Валюта;
					ОблЗамена.Параметры.БезНДС3 = Результат.БезНДС;
					ОблЗамена.Параметры.ДатаЗаказаВПути = Результат.Дата;					
					КонецЕсли;
		    	ТабДок.Вывести(ОблЗамена);				
				Иначе	
				ОблАналог.Параметры.Наименование = СокрЛП(ВыбАналог.Наименование);
				ОблАналог.Параметры.МПЗ = ВыбАналог;
				ОблАналог.Параметры.Статус = ПолучитьСтатус(ВыбАналог);
				ОблАналог.Параметры.ГруппаПоЗакупкам = ВыбАналог.ГруппаПоЗакупкам;
				ОблАналог.Параметры.ЕдиницаИзмерения = СокрЛП(ВыбАналог.ЕдиницаИзмерения.Наименование);
				Результат = ПолучитьПоследнююСпецификациюДоговора(ВыбАналог);
					Если Результат <> Неопределено Тогда				
					ОблАналог.Параметры.ДатаНачала = Результат.ДатаНачала;
					ОблАналог.Параметры.ДатаОкончания = Результат.ДатаОкончания;
					ОблАналог.Параметры.Цена = Результат.Цена;
					ОблАналог.Параметры.Валюта = Результат.Валюта;
					ОблАналог.Параметры.БезНДС1 = Результат.БезНДС;
					Иначе
					ОблАналог.Параметры.ДатаНачала = "";
					ОблАналог.Параметры.ДатаОкончания = "";
					ОблАналог.Параметры.Цена = "";
					ОблАналог.Параметры.Валюта = ""; 
					ОблАналог.Параметры.БезНДС1 = "";
					КонецЕсли;
				Результат = ПолучитьЦенуПоследнейЗакупки(ВыбАналог);
				ОблАналог.Параметры.ЦенаПоследнейЗакупки = Результат.Цена;
				ОблАналог.Параметры.ВалютаПоследнейЗакупки = Результат.Валюта;
				ОблАналог.Параметры.БезНДС2 = Результат.БезНДС;
				ОблАналог.Параметры.ДатаЗаказа = Результат.Дата;
				Результат = ПолучитьЦенуЗаказаВПути(ВыбАналог);
				ОблАналог.Параметры.ЦенаЗаказаВПути = Результат.Цена;
				ОблАналог.Параметры.ВалютаЗаказаВПути = Результат.Валюта;
				ОблАналог.Параметры.БезНДС3 = Результат.БезНДС;
				ОблАналог.Параметры.ДатаЗаказаВПути = Результат.Дата;
		    	ТабДок.Вывести(ОблАналог);				
				КонецЕсли;
			КонецЦикла;
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();
	КонецЦикла;
ТабДок.Вывести(ОблКонец);		
ТабДок.ФиксацияСверху = 6;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры
